examples/optimization/casebase/0/nut
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0;

boundaryField 
{ 
    inletAir
    {
        type    calculated;
        value   uniform 0;
    }
    inletH2
    {
        type    calculated;
        value   uniform 0;
    }
    wall
    {
        type    nutUWallFunction;
        value   uniform 0;
    }
    outlet
    {
        type    calculated;
        value   uniform 0;
    }
    wedgeLeft_1
    {
        type    cyclicAMI;
    }
    wedgeRight_1
    {
        type    cyclicAMI;
    }
} 


// ************************************************************************* //