examples/optimization/casebase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         simpleFoam;

startFrom           startTime;
startTime           0.0;
stopAt              endTime;
endTime             3000;
deltaT              1;

writeControl        timeStep;
writeInterval       3000;
purgeWrite          1;

writeFormat         ascii;

timeFormat          general;
timePrecision       6;

runTimeModifiable   true;

// ************************************************************************* //
