examples/optimization/casebase/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - pointSync true to guarantee points to line up.

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - change patch type from 'cyclic' to 'patch' in the polyMesh/boundary file.
// - loosen match tolerance to get case to load
// - regenerate cyclic as above

// Tolerance used in matching faces. Absolute tolerance is span of
// face times this factor. To load incorrectly matches meshes set this
// to a higher value.
matchTolerance 1E-3;

// Do a synchronisation of coupled points after creation of any patches.
pointSync false;

// Patches to create.
patches
(
    {
        // Name of new patch
        name wedgeLeft_1;

        // Type of new patch
        patchInfo
        {
            type cyclicAMI;

            // Optional: explicitly set transformation tensor.
            // Used when matching and synchronising points.
            neighbourPatch wedgeRight_1;
            transform       rotational;
            rotationAxis    (1 0 0);
            rotationCentre  (0 0 0);
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (wedgeLeft);
    }

    {
        // Name of new patch
        name wedgeRight_1;

        // Type of new patch
        patchInfo
        {
            type cyclicAMI;

            // Optional: explicitly set transformation tensor.
            // Used when matching and synchronising points.
            neighbourPatch  wedgeLeft_1;
            transform       rotational;
            rotationAxis    (1 0 0);
            rotationCentre  (0 0 0);
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (wedgeRight);
    }
);


// ************************************************************************* //
